perf/zero.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Zero
      duration: 120
      arrivalRate: 0

scenarios:
  - name: Root
    flow:
      - get:
          url: '/bbox/1'